app/controllers/students_controller.rb

  def index
    #TODO: ANDREW use pagination to avoid pulling all students at once
    if params[:movie]
      students_table = Student.arel_table
      @students = Student.where(students_table[:favoritemovie].matches("%#{params[:movie]}%"))
    else
      @students = Student.all
---
SELECT "students".* FROM "students"